data_text = {
    "1_mm": {
        "bachelor": {
            "6В07206": "kafedra_1",
            "6B07105": "kafedra_1",
            "6В07501": "kafedra_1",
            "6В07101": "kafedra_2",
            "6В07107": "kafedra_3",
            "6В07108": "kafedra_3",
            "6В07115": "kafedra_3",
            "6В06103": "kafedra_4",
            "6В07106": "kafedra_4",
        },
        "master": {
            "7М07102": "kafedra_1",
            "7М07136": "kafedra_1",
            "7М07115": "kafedra_1",
            "7М07117": "kafedra_1",
            "7М07112": "kafedra_1",
            "7М07128": "kafedra_1",
            "7М07129": "kafedra_1",
            "7M07113": "kafedra_2",
            "7М07111": "kafedra_3",
            "7М07108": "kafedra_3",
            "7M06105": "kafedra_4",
        },
        "phd": {
            "8D07102": "kafedra_1",
            "8D07113": "kafedra_1",
            "8D7111": "kafedra_1",
            "8D07112": "kafedra_2",
            "8D07110": "kafedra_3",
            "8D06104": "kafedra_4",
        },
    },
    "2_mm": "Ваша Дирекция Института (Деканат) находится по адресу Сатпаева 22B. Этаж 2. Кабинет 27. (Здание МCК) \n https://official.satbayev.university/ru/industrial-engineering \n Директор Института: Елемесов Касым Коптлеуович \n Email: k.yelemessov@satbayev.university \n https://official.satbayev.university/ru/teachers/elemesov-kasym-koptleuevich\n +7(727)320-40-36 \n Заместители директора: \n 1) Басканбаева Динара Джумабаевна (Курирует научную часть) \n Email: d.baskanbayeva@satbayev.university \n https://official.satbayev.university/ru/teachers/baskanbaeva-dinara-dzhumabaevna \n Тел: +7(727)320-40-46 \n 2) Нугман Ерик Зеинелович (Курирует учебную часть) \n Email: e.nugman@satbayev.university \n https://official.satbayev.university/ru/teachers/nugman-erik-zeinelovich \n Тел: +7(727)320-40-46 \n 3) Мырзакулов Максат Кендебаевич (Курирует Воспитательную часть) \n Email:  m.myrzakulov@satbayev.university \n https://official.satbayev.university/ru/teachers/myrzakulov-maksat-kendebaevich \n Тел: +7(727) 292-63-21 \n Тел. института: +7(727)320-41-36 \n Email менеджера: d.issayeva@satbayev.university" ,
    "8_mm": "<b>СПРАВКИ С МЕСТО УЧЕБЫ</b> \n\n Университет выдает справки с места учебы, которые подтверждают их академическую занятость в ВУЗе. Справки с места учебы выдаются только после издания Приказа о зачислении.\n\n Cправка с места учебы можно получить оставив заявку в личном кабинете (раздел <b>справка</b>)",
    "9_mm": "<b>Я АКТИВИСТ (ХОЧУ УЧАСТВОВАТЬ В СОЦИАЛЬНОЙ ЖИЗНИ)</b> \n\n Если у вас есть таланты и желаете стать активистом нашего университета, то вы можете связаться с заместителем директора по воспитательной части \n Мырзакулов Максат Кендебаевич \n Email:  m.myrzakulov@satbayev.university \n Тел: +7(727) 292-63-21 \n 19 МСК",
    "10_mm": "<b>ВОПРОС ПО ОБЩЕЖИТИЮ</b> \n\n 1) Напишите заявление на имя проректора \n 2) Предоставьте заявление в общежитие №1 \n Тел: +7(727)320-41-43 ",
    "11_mm": "<b>ОБХОДНОЙ ЛИСТ</b> \n\n После приказа об отчислении вы запускаете обходной лист (онлайн) на портале sso.satbayev.university . Отследить процесс подписание обходного листа можно увидеть нажав на номер <b>обходного листа.</b>",
    "1_qd": "<b>Я ХОЧУ ПОДАТЬ НА АППЕЛЯЦИЮ</b> \n\n Заявление на апелляцию подается в течение 24 часов после объявлений результатов на имя заведующей кафедры дисциплины (на имя председателя апелляционной комиссии). Например: если у вас вопрос по Математики, то вы подаете заявление на имя зав. кафедры <b>Высшей математики</b> \n 1) Кафедра <b>Высшей математики</b> находится в ГУК 801 каб. \n Заведующий кафедры Уалиев Жомарт Разханович \n Email: zh.ualiyev@satbayev.university \n\n 2) Кафедра <b>Общая физика</b> находится в ГУК 917 каб. \n Заведующий кафедры Лесбаев Айдос Бакытжанович \n Email: a.lesbayev@satbayev.university \n\n 3) Кафедра <b>Казахский и русский языки</b> находится в ГУК 512 каб. \n Заведующий кафедры Удербаев Алмас Жауынбаевич \n Email: a.uderbayev@satbayev.university \n Тел: +7 (727) 320-40-9721:45 \n\n 4) Кафедра <b>Английский язык</b> находится в ГУК 823 каб. \n Заведующая кафедры Турлыбекова Анар Орымбаевна \n Email: a.o.turlybekova@satbayev.university \n\n 5) Кафедра <b>Физическая культура</b> находится в ГМК 101 каб. \n Заведующий кафедры Иматалиев Талап Сайпуллаевич \n Email: t.imataliyev@satbayev.university \n Тел: +7 (727) 320-40-85 \n\n 6)	Кафедра <b>Общественные дисциплины</b> находится в ГУК 814 каб. \n Заведующая кафедры Анасова Каламкас Темиркуловна \n Email: k.anasova@satbayev.university \n Тел: +7 (727) 320-40-95",
    "2_qd": "<b>ИУП, РАСПИСАНИЕ</b> \n\n ИУП (индивидуальный учебный план) и расписание составляется до начала учебного семестра. \n ИУП составляется совместно с эдвайзером (Положение об эдвайзера) и нужно сдать в Офис регистратор. ОР Находится на 1 этаже ГУК. \n Email: or-help@satbayev.university \n Тел: +7 (727) 320-41-16 \n\n Период перерегистрации (Add/Drop неделя), корректировка ИУПов проходит в первые недели учебного семестра. В этот период можно корректировать расписание, ИУПы и отложить предмет на поздний срок (W- withdrawal).\n Withdrawal предметов после завершении периода бесплатного снятия будет на платной основе.",
    "3_qd": "<b>ПОМЕНЯТЬ ПРЕПОДОВАТЕЛЯ</b> \n\n Поменять преподавателя можно только в период перерегистрации (Add/Drop неделя) в начале семестра",
    "4_qd": "<b>ХОЧУ ПОДАТЬ НА ВАКАНТНЫЙ ГРАНТ</b> \n\n Подать на вакантный государственный образовательный грант можно в каникулярный период после окончательных оценок. На вакантный грант можно подать с GPA 2.5 и выше. \n Заявление на вакантный грант подается в Офис регистратор. ОР Находится на 1 этаже ГУК.  \n Email: or-help@satbayev.university \n Тел: +7 (727) 320-41-16",
    "5_qd": "<b>АКАДЕМИЧЕСКИЙ ОТПУСК</b> \n\n Академический отпуск могут получить студенты, которые: \n 1) Призываются в армию \n 2) По беременностью (от 24 неделя, Железодефицитная анемия (ЖДА), угроза прерывания беременности (УПБ), ВКК от гинеколога Форма 037/у) \n 3) По уходу за маленьким ребёнком \n 4) По состоянию здоровья (при наличии справки ВКК из мед. учреждения) \n Заявление подается с копией удостоверения личности и справками \n Нельзя получить академический отпуск по семейным обстоятельствам и финансовому положению. \n Заявление пишется на имя Проректора по академическим вопросам с подписью студента и визами эдвайзера, зав. кафедры, директора института (27 МСК), директора ОР (офис регистратор) и бухгалтерией (203 НК (Нефтяной корпус)). \n К заявлению прилагаете Представление от Дирекции института и сдаете документы в канцелярию 201 НК (Нефтяной корпус)",
    "6_qd":{
        "1_iqd":"<b>ПЕРЕВОД В SATBAYEV UNIVERSITY</b> \n\n Если вы обучаетесь на гранте и переводитесь на схожую специальность, то ваш грант сохраняется, в противном случае вы будете обучаться на платной основе. \n В первую очередь вам необходимо получить разрешение из вашего университета написав заявление на перевод. После вы пишете заявление в наш университет предоставив разрешительные документы, копию удостоверения личности и официальный транскрипт. \n Все документы нужно предоставить в дирекцию института по адресу Сатпаева 22В Этаж 2. Кабинет 27. (Здание МСК) или направить на Email: e.nugman@satbayev.university \n Мы принимаем ваши документы и издаём приказ о переводе. А вы в это время заполняете анкету студента на kb.satbayev.university",
        "2_iqd":"<b>ПЕРЕВОД С SU В ДРУГОЙ ВУЗ</b> \n\n Подумайте, нужно ли вам переводится с Национального технического ВУЗа в другие университеты. \n Если вы обучаетесь на гранте и переводитесь на схожую специальность, то ваш грант сохраняется, в противном случае вы будете обучаться на платной основе. \n Если у вас есть весомые причины для перевода в другой ВУЗ, то алгоритм такой:\n 1) Вы пишете заявление на имя Проректора по академическим вопросам с подписью студента и визами эдвайзера, зав. кафедры, директора института (27 МСК), директора ОР (офис регистратор) и бухгалтерией (203 НК (Нефтяной корпус)) (*если у вас имеется финансовая задолженность, то необходимо оплатить задолженность и приложить чек оплаты). \n 2) После того как вы собрали все необходимые подписи сдаете в приемную 302 НК (Нефтяной корпус) \n 3) Вы получаете университетский печать на ваше заявление с разрешением в бухгалтерии 217 НК (Нефтяной корпус) \n 4) В офис регистраторе запрашиваете официальный транскрипт \n 5) После зачисления в другой ВУЗ не забудьте заполнить обходной лист в Satbayev University на портале (SSO)"
    },
    "7_qd": {
        "3_iqd":"<b>Я ХОЧУ ВОССТАНОВИТЬСЯ</b> \n\n Для восстановления на учебу в университет у студента должны отсутствовать не закрытые дисциплины в 1-м семестре (F) и иметь общий бал ЕНТ 65 с предметами физика и математика. \n 1) Вы пишете заявление на имя Проректора по академическим вопросам с подписью студента и визами зав. кафедры, директора института (27 МСК), директора ОР (офис регистратор) и бухгалтерией (203 НК (Нефтяной корпус)) (*если у вас имеется финансовая задолженность, то необходимо оплатить задолженность и приложить чек оплаты). \n 2) К заявлению прилагаете Представление от Дирекции института 27 (МСК) и сдаете документы в канцелярию 201 НК (Нефтяной корпус)",
        "4_iqd":"<b>Я ХОЧУ ОТЧИСЛИТЬСЯ</b> \n\n Для отчисления с университета по собственному желанию вы пишите заявление на имя Проректора по академическим вопросам. После приказа об отчислении вы запускаете обходной лист (онлайн) на портале sso.satbayev.university . Отследить процесс подписание обходного листа можно увидеть нажав на номер обходного листа. \n 1) Вы пишете заявление на имя Проректора по академическим вопросам с подписью студента и визами эдвайзера, зав. кафедры, директора института (27 МСК), директора ОР (офис регистратор) и бухгалтерией (203 НК (Нефтяной корпус)) (*если у вас имеется финансовая задолженность, то необходимо оплатить задолженность и приложить чек оплаты). \n 2) К заявлению прилагаете Представление от Дирекции института 27 (МСК) и сдаете документы в канцелярию 201 НК (Нефтяной корпус)"
    },
    "8_qd": "<b>Я ХОЧУ ПОЛУЧИТЬ СКИДКУ</b> \n\n Satbayev University предоставляет скидки студентам на обучение по определённым категориям студентов: социально-уязвимым студентам, отличникам, мастерам спорта. А также материально поощряет победителей международных олимпиад и конкурсов. Предоставление скидок осуществляется согласно Положению на образовательные услуги и материальному стимулированию (поощрению) обучающихся по социальным и другим категориям:\n 1) Сироты; \n 2) Студенты-инвалиды (или оба родители инвалиды);\n 3) Многодетная семья (дети в возрасте до 18 лет); \n 4) Дети из неполной семьи и других социально-уязвимых слоев населения (GPA не менее 2.67). \n 5) Отличники учебы (GPA не менее 3.67) (2-4 курс); \n 6) Спортсмены имеющий спортивный разряд мастера спорта РК; \n 7) Мастер спорта международного класса РК.22:12 \n\n Курирует данный вопрос Отдел по социальной работе 408 НК (Нефтяной корпус) \n Тел: +7(727)320-40-75. \n E-mail: zh.ibragimova@satbayev.university \n\n Заявку на скидку вы можете подать онлайн \n https://official.satbayev.university/ru/department-for-student-affairs/skidki-na-obuchenie",
    "9_qd": "<b>ОПЛАТА ПО ЧАСТЯМ</b> \n\n Если у вас сложилась трудность с оплатой за обучение или задолженности, то вы можете заполнить заявление на оплату по частям или равными долями. Заявление рассматривается руководством университета. \n 1) Пишете заявление на имя Проректора с подписью студента и визами эдвайзера, зав. кафедры и директора института (27 МСК). В заявлений указываете четкий график оплаты с конкретными датами месяца. \n 2) Прилагаете необходимые подтверждающие документы (Например если у вас многодетная семья, вы прилагаете копии свидетельство о рождении детей, копию удостоверения личности мамы и справку о многодетной семьи с ЦОНа) \n 3) Прилагаете письмо в свободной форме от родителя о том, что они дают согласие на составленный вами график и копию удостоверение личности родителя \n 4) Составляете и подписываете Соглашение с графиком оплаты в дирекции Института 27 МСК \n 5) После необходимо сдать документы в канцелярию 201 НК (Нефтяной корпус)",
    "10_qd": "<b>Я ПОЛУЧИЛ ГРАНТ, ХОЧУ ВЕРНУТЬ ДЕНЬГИ</b> \n\n Если вы во время учебы на платиной основе получили грант и хотите вернуть оплаченные средства, то вы можете написать заявление на имя Проректора \n 1) Пишете заявление на имя Проректора с подписью студента и визами эдвайзера, зав. кафедры, директора института  (МСК 27) и бухгалтерией (203 НК (Нефтяной корпус)). В заявлений указываете IBAN карточного счета. \n 2) Прилагаете распечатанную версию реквизита карточного счета и копию удостоверение личности \n 3) После сдаете документы в канцелярию 201 НК (Нефтяной корпус)",
    "11_qd": "<b>Я ВЕРНУЛ СТИПЕНДИЮ, КОГДА ПОСТУПЯТЬ ДЕНЬГИ</b> \n\n Если в конце учебного семестра вы набрали 70 и выше по всем предметам и вернули стипендию, то ваша стипендия вернется вам после приказа и на втором месяце следующего семестра.",
    "12_qd": "<b>ГДЕ ОФОРМИТЬ  КАРТУ  ХАЛЫК БАНКА</b> \n\n Представители Халык банка принимают заявки и выдают банковские карточки на 1-м этаже ГУК по средам с 11:00 до 17:00 \n Кто на удаленки, пусть заполняют заявление + копия уд и скидывают скан вариант  на почту: talgatKa@halykbank.kz",
    "13_qd": "<b>Я ПОТЕРЯЛ ID-КАРТУ</b> \n\n Если вы потеряли ID-карту, то перевыпуск ID-карты будет стоить 1000 тг. \n 1) Для перевыпуска ID-карты вам необходимо запросить служебную записку в дирекции Института 27 МСК \n 2) Служебную записку необходимо сдать в ЦОД 342, 344 ГМК и приложить чек оплаты за перевыпуск",
    "14_qd": "<b>Я НЕ ПОЛУЧИЛ ID-КАРТУ</b> \n\n 1)Для выпуска ID-карты вам необходимо запросить служебную записку в дирекции Института 27 МСК. \n 2) Служебную записку необходимо сдать в ЦОД 342, 344 ГМК",
    "15_qd": "<b>ВОПРОС ПО ВОЕНКОМАТУ</b> \n\n Университет выдает справки с места учебы, которые подтверждают их академическую занятость в ВУЗе. Справки с места учебы выдаются только после издания Приказа о зачислении. \n Cправка по воинскому учету (для отсрочки от армии) занимается Сектор воинского учета 341 каб. ГУК Тел: +7 (727)292-77-97",
    "16_qd": "<b>СПРАВКА ДЛЯ ВОЕННОЙ КАФЕДРЫ</b> \n\n При Satbayev University есть Институт военного дела (ИВД). Всю необходимую информацию ИВД публикуют на официальном сайте университета https://official.satbayev.university/, https://satbayev.university/ \n Ответы на все вопросы по военной кафедре можете найти в отдельном телеграм боте: \n @Idet_military_department_bot \n Институт военного дела находится ул. Байтурсынова 140 \n Тел: +7(727)292-04-82, 292-08-45 \n Cправка для ИВД можно получить на портале https://sso.satbayev.university/",
    "17_qd": "<b>МНЕ НУЖЕН ОНАЙ</b> \n\n По вопросам Оңай вы можете обратиться в Отдел по социальной работе 408 НК \n Тел: +7(727)320-40-75 \n https://instagram.com/onay.satbayev?utm_medium=copy_link ",
    "18_qd": "<b>ВОПРОС ПО МЕД.СТРАХОВКИ</b> \n\n По вопросам мед. страховки вы можете обратиться в Офис регистратор 1 этаж ГУК \n Тел: +7 (727) 320-41-16 \n Email: or-help@satbayev.university",
}

degrees_data = {
    "bachelor":"Бакалавриат", 
    "master":"Магистратура", 
    "phd":"Phd докторантура"
}

specialities_data = {
    "bachelor":{
        "6В07206":"ОП 6В07206 Индустриальная инженерия",
        "6B07105":"ОП 6B07105 Индустриальная инженерия",
        "6В07501":"ОП 6В07501 Индустриальная инженерия",
        "6В07101":"6В07101 Энергетика",
        "6В07107":"6В07107 Эксплуатационно-сервисная инженерия",
        "6В07108":"6В07108 Транспортная инженерия",
        "6В07115":"6В07115 Технологические машины и оборудование (по отраслям)",
        "6В06103":"6В06103 Математическое и компьютерное моделирование",
        "6В07106":"6В07106 Инженерная механика",
    }, 
    "master":{
        "7М07102":"ОП 7М07102 Аддитивное производство",
        "7М07136":"ОП 7М07136 Аддитивное производство",
        "7М07115":"ОП 7М07115 Аддитивное производство",
        "7М07117":"ОП 7М07117 Аддитивное производство",
        "7М07112":"ОП 7М07112 Цифровизация машиностроительного производства",
        "7М07128":"ОП 7М07128 Цифровизация машиностроительного производства",
        "7М07129":"ОП 7М07129 Цифровизация машиностроительного производства",
        "7M07113":"7M07113 Электротехника и энергетика",
        "7М07111":"7М07111 Цифровая инженерия машин и оборудования",
        "7М07108":"7М07108 Транспорт, транспортная техника и технологии",
        "7M06105":"7M06105 Кибернетика и искусственный интеллект",
    }, 
    "phd":{
        "8D07102":"ОП 8D07102 Аддитивное производство",
        "8D07113":"ОП 8D07113 Аддитивное производство",
        "8D7111":"ОП 8D7111 Цифровизация машиностроительного производства",
        "8D07112":"8D07112 Электроэнергетика",
        "8D07110":"8D07110 Цифровая инженерия машин и оборудования",
        "8D06104":"8D06104 Кибернетика и искусственный интеллект",
    }
}

main_menu_data = {
    "1_mm": "Где находится моя кафедра?",
    "2_mm": "Где находится мой институт?",
    "3_mm":"У меня вопрос по учебе",
    "4_mm":"У меня финасовый вопрос",
    "5_mm":"Где получить ID карту",
    "6_mm":"Вопрос по военкомату/военная кафедра",
    "7_mm":"Оңай/Медостраховка",
    "8_mm":"Справка с места учебы",
    "9_mm":"Я активист (хочу учасвтсвовать в социальной жизни)",
    "10_mm":"Вопрос по общежитию",
    "11_mm":"Обходной лист"
}

questions_data = {
    "3_mm":{
        "1_qd":"Я хочу подать на аппеляцию",
        "2_qd":"ИУП, Расписание",
        "3_qd":"Поменять преподователя",
        "4_qd":"Хочу подать на вакантный грант",
        "5_qd":"Академический отпуск",
        "6_qd":"Перевод между вузами",
        "7_qd":"Я хочу восстановиться/отчислиться",
    },
    "4_mm":{
        "8_qd":"Я хочу получить скидку",
        "9_qd":"Оплата по частям",
        "10_qd":"Я получил грант, хочу вернуть деньги",
        "11_qd":"Я вернул стипендию, когда поступят деньги",
        "12_qd":"Где оформить карту Халык банка",
    },
    "5_mm":{
        "13_qd":"Я потерял карту",
        "14_qd":"Я не получил карту",
    },
    "6_mm":{
        "15_qd":"Вопрос по военкомату",
        "16_qd":"Справка для военное кафедры"
    },
    "7_mm":{
        "17_qd":"Мне нужен Оңай",
        "18_qd":"Вопрос Мед. страховки"
    }
}

in_questions_data = {
    "6_qd":  {
        "1_iqd":"Первод в Satbayev University",
        "2_iqd":"Перевод из Satbayev University в другой ВУЗ"
    },
    "7_qd": {
        "3_iqd":"Я хочу восстановиться",
        "4_iqd":"Я хочу отчислиться"
    }
    
}

kafedras = {
    "kafedra_1": "Кафедра <b>Машиностроение, стандартизация, сертификация и метрология</b>\n Ваша Кафедра находится по адресу Сатпаева 22B. Этаж 2. Кабинет 204. (Здание ИМC)\n https://official.satbayev.university/ru/industrial-engineering/mcmstmp\n <b>Заведующий(ая) кафедрой</b>\n Исаметова Мадина Есдаулетовна\n m.issametova@satbaeyv.university\n https://official.satbayev.university/ru/teachers/isametova-madina-esdauletovna",
    "kafedra_2": "Кафедра <b>Энергетики</b>\n Ваша Кафедра находится по адресу Сатпаева 22. Этаж 2. Кабинет 209. (Здание ГМК) \n https://official.satbayev.university/ru/industrial-engineering/kafedra-energetiki\n <b>Заведующий(ая) кафедрой</b>\n Сарсенбаев Ерлан Алиаскарович\n Тел. кафедры: +7(727)320-41-22\n y.sarsenbayev@satbayev.university\n https://official.satbayev.university/ru/teachers/sarsenbaev-erlan-aliaskarovich\n ",
    "kafedra_3": "Кафедра <b>Технологических машин и транспорта</b> \n Ваша Кафедра находится по адресу Сатпаева 22. Этаж 2. Кабинет 222. (Здание ГМК)\n https://official.satbayev.university/ru/mining-metallurgy/lmh \n Заведующий(ая) кафедрой \n Бортебаев Сайын Абильханович \n Тел. кафедры: +7(727)320-44-14 \n s.bortebayev@satbayev.university \n https://official.satbayev.university/ru/teachers/bortebaev-sayyn-abilkhanovich \n",
    "kafedra_4": "Кафедра <b>Инженерная механика и моделирование</b> \n https://official.satbayev.university/ru/industrial-engineering/kafedra-inzhenernaya-mekhanika-i-modelirovanie \n Заведующий(ая) кафедрой \n Калтаев Айдархан \n a.kaltayev@satbayev.university \n https://official.satbayev.university/ru/teachers/kaltaev-aydarkhan"

}